#pragma once

/*ОБЩАЯ ИГРОВАЯ ЛОГИКА*/

/*Функция проверки выйгрыша игрока
Принимает массив игрового поля и идентификатор игрока
в случае успеха возвращает true, в противном случае false*/
bool IsWin(const Game const * game, const char player);

/*Функция проверки ничьи
Принимает массив игрового поля
в случае успеха возвращает true, в противном случае false*/
bool IsTie(const Game const * game);

/*ЛОГИКА КОМПЬЮТЕРА КАК СОПЕРНИКА*/

/*Функция решающего хода компьютера (в случае если есть в ряд
два нолка компьютера и 3я клетка свободна, то он ставит туда нолик
и выигрывает, и так же если есть два крестика противника то он
ставит туда нолик и остается в игре, если это единственный вариант)
Функция принимает указатель на структуру игры, а так же идентификтор игрока
(для атакующего хода или защитниого)
В случае успеха делает ход и возвращает true, в противном случае
ничего не делает и возвращает false*/
bool CriticalTurn(Game * game, const char player);

/*Функция обычного хода компьютера
Функция принимает указатель на структуру игры*/
void ComputerTurn(Game * game);

/*Функция сохранения игры
Функция принимает указатель на структуру Игры
В случае успеха возвращает true иначе false*/
bool SaveGame(const Game * game);

/*Функция загрузки последней сохраненной игры
Функция принимает указатель на структуру Игры
В случае успеха возвращает true иначе false*/
bool LoadGame(Game * game);

/*Функция поиска файла
Принимает строку с названием и расширением файла
если файл есть то возвращает true, иначе false*/
bool IsFileExists(const char * fname);