#pragma once

//Функция отрисовки игрового поля
void PrintField(const Game const * game);

//Функция отчистки потока ввода
inline void ClearStdIn()
{
	char c;
	do {
		c = getchar();
	} while (c != '\n');
}

/*Функция предлагает ввести игроку
координаты для установки знака
Принимает указатель на игровое поле и 
идентификатор игрока*/
void PlayerTurn(Game * game, const char const * player);

/*Функция определяет пользовательские параметры игры.
Принимает указатель на структуру игры,
предлагает ввести тип игры (1 игрок или 2 игрока),
предлагает ввести сложность игры*/
void FillGameSettings(Game * game);

/*Функция спрашивает - желает ли игрок продолжить игру с
последнего сохранения.
Если да то возвращает true, в противном случае false*/
bool ContinuneGame();

/*Функция спрашивает - желает ли игрок прочитать руководство
если да то возвращает true, если нет то false*/
bool IsReadManual();
